---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SolutionIsOppositeToConnectionError
source: html/ac5bad91-1c17-543e-4819-4c9eae57ab3a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SolutionIsOppositeToConnectionError Property

The solution is in the opposite direction of the connection direction.

## Syntax (C#)
```csharp
public static FailureDefinitionId SolutionIsOppositeToConnectionError { get; }
```